tutorials/fluids/sonicLiquidFluid/decompressionTank/constant/thermodynamicProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermodynamicProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rho0            rho0 [ 1 -3 0 0 0 0 0 ] 1000;
p0              p0 [ 1 -1 -2 0 0 0 0 ] 100000;
psi             psi [ 0 -2 2 0 0 0 0 ] 4.54e-07;

// ************************************************************************* //
