tutorials/fluids/sonicLiquidFluid/decompressionTank/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          BiCGStab;
        preconditioner  DILU;
        minIter         1;
        tolerance       1e-08;
        relTol          0;
    }

	pcorr
	{
		solver          GAMG;
		tolerance       1e-07;
		relTol          0;
		smoother        DIC;
		nPreSweeps      0;
		nPostSweeps     2;
		nFinestSweeps   2;
		cacheAgglomeration true;
		nCellsInCoarsestLevel 10;
		agglomerator    faceAreaPair;
		mergeLevels     1;
	}

    U
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }

    UFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-09;
        relTol          0;
    }

    rho
    {}
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  2;
    nCorrectors       2;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
	p	0.3;
	U	0.7;
	UFinal 1;
}


// ************************************************************************* //
