tutorials/fluids/sonicLiquidFluid/decompressionTank/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Create the mesh
runApplication blockMesh

# Run the solver
runApplication solids4Foam

# ----------------------------------------------------------------- end-of-file

